StartMilandr/MDR_Pack_v6/SVD_Files/GPIO/MDR1986VK214_GPIO.svd
        <!-- SETTX -->
        <register>
          <name>SETTX</name>
          <description>Set RXTX by MASK</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <modifiedWriteValues>oneToSet</modifiedWriteValues>
          <fields>
            <field>
              <dim>15</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14</dimIndex>
              <name>Pin_%s</name>
              <description>Set 1 to pin</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Do nothing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Set High level to pin with reg RXTX</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <!-- CLRTX -->
        <register>
          <name>CLRTX</name>
          <description>CLR RXTX by MASK</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <dim>15</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14</dimIndex>
              <name>Pin_%s</name>
              <description>Clear pin to 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Do nothing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Set Low level to pin with reg RXTX</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <!-- RDTX -->
        <register>
          <name>RDTX</name>
          <description>Value of RXTX in Port mode</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <dim>15</dim>
              <dimIncrement>1</dimIncrement>
              <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14</dimIndex>
              <name>Pin_%s</name>
              <description>Pin data value</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>LOW Level Voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>HIGH Level Voltage</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>

        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>

    <!-- GPIO_PORTC -->
    <peripheral derivedFrom="MDR_PORTA">
      <name>MDR_PORTC</name>
      <baseAddress>0x40090000</baseAddress><!--#BE4,#BK214,#BK234-->
    </peripheral>

    <!-- GPIO_PORTD -->
    <!--#BE1,#BE3,#BE9x,#VC1-->
    <!--peripheral derivedFrom="MDR_PORTA">
      <name>MDR_PORTD</name>
      <baseAddress>0x400C0000</baseAddress>
    </peripheral-->

    <!-- GPIO_PORTE -->
    <!--#BE1,#BE3,#BE9x,#VC1-->
    <!--peripheral derivedFrom="MDR_PORTA">
      <name>MDR_PORTE</name>
      <baseAddress>0x400C8000</baseAddress>
    </peripheral-->

    <!-- GPIO_PORTF -->
    <!--#BE1,#BE3,#BE9x,#VC1-->
    <!--peripheral derivedFrom="MDR_PORTA">
      <name>MDR_PORTF</name>
      <baseAddress>0x400E8000</baseAddress>
    </peripheral-->

    <!-- GPIO_PORTG -->
    <!--#BE3-->
    <!--peripheral derivedFrom="MDR_PORTA">
      <name>MDR_PORTG</name>
      <baseAddress>0x40118000</baseAddress>
    </peripheral-->

    <!-- GPIO_PORTH -->
    <!--#BE3-->
    <!--peripheral derivedFrom="MDR_PORTA">
      <name>MDR_PORTH</name>
      <baseAddress>0x40138000</baseAddress>
    </peripheral-->

    <!-- GPIO_PORTI -->
    <!--#BE3-->
    <!--peripheral derivedFrom="MDR_PORTA">
      <name>MDR_PORTI</name>
      <baseAddress>0x40140000</baseAddress>
    </peripheral-->


    <!-- peripherals end-->
  </peripherals>

</device>  